import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class KnowledgeService {
  preset: { [key: string]: { "title": string, "content": string }[] };
  constructor() {
    this.preset = {
      "发动": [
        {
          "title": "检查车辆状况",
          "content": "确认所有车门、引擎盖和后备箱是否关闭。检查轮胎是否正常，确保没有漏气或损坏。确保车内没有异味，指示灯是否正常。"
        },
        {
          "title": "正确启动引擎",
          "content": "插入车钥匙并转动到启动位置，或按下启动按钮（如果是无钥匙启动）。等待仪表盘上的指示灯熄灭后，再启动引擎。启动后，注意引擎声音是否正常，如有异常应立即检查。"
        },
        {
          "title": "安全启动准备",
          "content": "确保座椅、后视镜和方向盘调整到合适位置。系好安全带并确保乘客也系好安全带。检查周围环境，确保无障碍物，尤其是小孩或宠物。"
        }
      ],
      "转弯": [
        {
          "title": "提前减速",
          "content": "转弯前应提前减速，避免在弯道中急刹车或加速。保持合适的车速，根据弯道的角度和路况调整速度。"
        },
        {
          "title": "打转向灯",
          "content": "提前打转向灯，提醒后方和旁边的车辆及行人。一般在距离转弯点30米左右开始打灯。"
        },
        {
          "title": "观察路况",
          "content": "在转弯前仔细观察前后左右的交通状况，确保安全。注意盲区，尤其是在转大弯或进入小路时。"
        },
        {
          "title": "控制方向盘",
          "content": "平稳地转动方向盘，不要突然转动或猛打方向。转弯过程中双手握住方向盘，保持控制力。"
        }
      ],
      "变道": [
        {
          "title": "提前观察",
          "content": "使用后视镜和侧视镜，观察后方和侧方车辆情况。注意盲区，必要时转头确认盲区内是否有车辆或行人。"
        },
        {
          "title": "打转向灯",
          "content": "提前打转向灯，提醒后方车辆你准备变道。打灯后稍等几秒钟，让后方车辆有时间反应。"
        },
        {
          "title": "判断距离和速度",
          "content": "确保变道的距离足够，并且变道后不会影响到后方车辆。确认车速合适，不要突然加速或减速。"
        },
        {
          "title": "平稳变道",
          "content": "在确认安全后，平稳地变道，不要突然转动方向盘或急刹车。变道完成后，及时关闭转向灯，并继续保持合适的车速。"
        }
      ]
    };
  }

  getKnowledge(theme: string) {
    if(theme in this.preset){
      return this.preset[theme];
    }
    return [];
  }
}

